defmodule Semantic do
  def start(str) do
    {:ok, tree} = ParserBridge.parse(str)

    # 1. Валидация типов + разрешение имен
    # 2. Проверка корректного обращения к структурам
    # 3. Проверка паттерн матчинга?
    # 4. Проверка сходимости рекурсии?

    IO.puts("""
         @@@           @@@           @@@
       @@@@@@@       @@@@@@@       @@@@@@@
     @@@@@@@@@@@   @@@@@@@@@@@   @@@@@@@@@@@
      @@@@@@@@       @@@@@@@       @@@@@@@
         @@@           @@@           @@@
          |             |             |
          |             |             |
          |             |             |
        Haskell compiler. Enjoy the ride
    """)

    tree
  end
end
